<a href="https://colab.research.google.com/github/Mateusz97P/laboratorium-missp/blob/main/projekt/PROJEKT_TITANIC_Mateusz_Pluta_208965.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Mateusz Pluta
#208965

Projekt pod tytułem "Titanic" to jeden z konkursów na platformie kaggle.com. Zadaniem w tym projekcie było napisanie programu, który przewidzi kto przeżyje katastrofę statku. 

Baza "train.csv" zawiera informacje o podróżnych oraz o tym czy przeżyli katastrofę statku. W programie trzeba sprawdzić kto z bazy "test.csv" przeżyje katastrofę.

Dodanie baz "numpy" oraz "pandas".

In [11]:
import numpy as np 
import pandas as pd

Dodanie bazy "train.csv" i ukazanie pierwszych wierszy bazy danych.

In [15]:
train_df = pd.read_csv("https://raw.githubusercontent.com/Mateusz97P/laboratorium-missp/main/projekt/train.csv")
train_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Dodanie bazy "test.csv" i ukazanie pierwszych wierszy bazy danych.

In [16]:
test_df = pd.read_csv("https://raw.githubusercontent.com/Mateusz97P/laboratorium-missp/main/projekt/test.csv")
test_df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

Wypisanie najważniejszych danych z bazy "train.csv".

In [18]:
print("Train df:")
train_df.describe()

Train df:

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

Wypisanie najważniejszych danych z bazy "test.csv".

In [19]:
print("Test df:")
test_df.describe()

Test df:

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

Sprawdzenie typu danych z poszczególnych kolumn i ilości niepustych wierszy i kolumn w bazach "test.csv" oraz "train.csv".

In [28]:
train_df.info()
print()
print(40*"_")
print()
test_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Cabin        202 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 90.3+ KB

________________________________________

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         418 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

Wypisanie niepełnych kolumn i wierszy w bazach "train.csv" i "train.csv", które należy uzupełnić albo usunąć z baz.

In [22]:
print("Przed czyszczeniem danych:")
print("Brak wartości w pliku train_df:")
missing_val_count_by_column = (train_df.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])
print()
print("Brak wartości w pliku test_df:")
missing_val_count_by_column = (test_df.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])

Przed czyszczeniem danych:
Brak wartości w pliku train_df:
Age         177
Cabin       687
Embarked      2
dtype: int64

Brak wartości w pliku test_df:
Age       86
Fare       1
Cabin    327
dtype: int64

W bazie "train.csv" brakujący wiek podróżnych uzupełniono medianą wieku podróżnych, brakujące informacje na temat podjęcia pasażerów na statek zostana usunięte. Typ danych w bazie zmieniono na "Embarked".

W bazie "test.csv" brakujące ceny biletów uzupełniono medianą cen wszystkich biletów.

In [24]:
train_df.Age = train_df.Age.fillna(train_df.Age.median())

train_df.dropna(subset=['Embarked'],inplace = True)
one_hot_encoded_training_predictors = pd.get_dummies(train_df.Embarked)

test_df.Age = test_df.Age.fillna(test_df.Age.median())
test_df.Fare = test_df.Fare.fillna(test_df.Fare.median())

In [25]:
print("Po wyczyszczeniu danych:")
print("Brak wartości w pliku train_df:")
missing_val_count_by_column = (train_df.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])
print()
print("Brak wartości w pliku test_df:")
missing_val_count_by_column = (test_df.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])

Po wyczyszczeniu danych:
Brak wartości w pliku train_df:
Cabin    687
dtype: int64

Brak wartości w pliku test_df:
Cabin    327
dtype: int64

Model projektu jest uczony metodą lasów losowych.

In [27]:
from sklearn.ensemble import RandomForestClassifier

y = train_df["Survived"]

features = ["Pclass", "Sex", "Age", "SibSp", "Parch", "Fare", "Embarked"]
X = pd.get_dummies(train_df[features])
X_test = pd.get_dummies(test_df[features])

model = RandomForestClassifier(n_estimators=130, max_depth=7, random_state=1)
model.fit(X, y)
predictions = model.predict(X_test)

output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
output.to_csv('submission.csv', index=False)
print("Twoje zgłoszenie zostało pomyślnie zapisane")

Twoje zgłoszenie zostało pomyślnie zapisane!